In [4]:
# Raw data downloaded as .txt file from https://dahiti.dgfi.tum.de/en/639/water-level-altimetry/

import pandas as pd
data = pd.read_csv('./water_level_Danube.txt', sep=',')
data

           date  water level  error
0    2002-07-06       72.938  0.040
1    2002-08-10       72.852  0.064
2    2002-09-14       73.013  0.018
3    2002-10-19       74.335  0.008
4    2002-11-23       75.696  0.011
..          ...          ...    ...
112  2016-01-11       72.330  0.007
113  2016-02-15       73.189  0.011
114  2016-03-21       73.061  0.003
115  2016-04-25       73.164  0.022
116  2016-05-30       72.434  0.006

[117 rows x 3 columns]

In [5]:
# check the data type
data.dtypes

date            object
water level    float64
error          float64
dtype: object

In [6]:
#convert date from 'object' to 'datetime'
data['date'] = pd.to_datetime(data['date'])

data.dtypes

date           datetime64[ns]
water level           float64
error                 float64
dtype: object

In [7]:
# export to .csv
data.to_csv('./water_level_2002_2016_Danube.csv', index= False)